yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3le89.h
#define MASK_USART3_BRR2_USART_DIV0 0x01
#define MASK_USART3_BRR2_USART_DIV1 0x02
#define MASK_USART3_BRR2_USART_DIV2 0x04
#define MASK_USART3_BRR2_USART_DIV3 0x08
#define MASK_USART3_BRR2_USART_DIV12 0x10
#define MASK_USART3_BRR2_USART_DIV13 0x20
#define MASK_USART3_BRR2_USART_DIV14 0x40
#define MASK_USART3_BRR2_USART_DIV15 0x80

#define MASK_USART3_CR1_PIEN     0x01
#define MASK_USART3_CR1_PS       0x02
#define MASK_USART3_CR1_PCEN     0x04
#define MASK_USART3_CR1_WAKE     0x08
#define MASK_USART3_CR1_M        0x10
#define MASK_USART3_CR1_USARTD   0x20
#define MASK_USART3_CR1_T8       0x40
#define MASK_USART3_CR1_R8       0x80

#define MASK_USART3_CR2_SBK      0x01
#define MASK_USART3_CR2_RWU      0x02
#define MASK_USART3_CR2_REN      0x04
#define MASK_USART3_CR2_TEN      0x08
#define MASK_USART3_CR2_ILIEN    0x10
#define MASK_USART3_CR2_RIEN     0x20
#define MASK_USART3_CR2_TCIEN    0x40
#define MASK_USART3_CR2_TIEN     0x80

#define MASK_USART3_CR3_LBCL     0x01
#define MASK_USART3_CR3_CPHA     0x02
#define MASK_USART3_CR3_CPOL     0x04
#define MASK_USART3_CR3_CLKEN    0x08
#define MASK_USART3_CR3_STOP     0x30

#define MASK_USART3_CR4_ADD      0x0F

#define MASK_USART3_CR5_EIE      0x01
#define MASK_USART3_CR5_IREN     0x02
#define MASK_USART3_CR5_IRLP     0x04
#define MASK_USART3_CR5_HDSEL    0x08
#define MASK_USART3_CR5_NACK     0x10
#define MASK_USART3_CR5_SCEN     0x20
#define MASK_USART3_CR5_DMAR     0x40
#define MASK_USART3_CR5_DMAT     0x80


/*-------------------------------------------------------------------------
 *      LCD register definitions
 *-----------------------------------------------------------------------*/
/* LCD control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char B2          : 1;
  unsigned char DUTY0       : 1;
  unsigned char DUTY1       : 1;
  unsigned char BLINKF0     : 1;
  unsigned char BLINKF1     : 1;
  unsigned char BLINKF2     : 1;
  unsigned char BLINK0      : 1;
  unsigned char BLINK1      : 1;
} __BITS_LCD_CR1;
#endif
__IO_REG8_BIT(LCD_CR1,     0x5400, __READ_WRITE, __BITS_LCD_CR1);

/* LCD control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VSEL        : 1;
  unsigned char CC0         : 1;
  unsigned char CC1         : 1;
  unsigned char CC2         : 1;
  unsigned char HD          : 1;
  unsigned char PON0        : 1;
  unsigned char PON1        : 1;
  unsigned char PON2        : 1;
} __BITS_LCD_CR2;
#endif
__IO_REG8_BIT(LCD_CR2,     0x5401, __READ_WRITE, __BITS_LCD_CR2);

/* LCD control register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DEAD0       : 1;
  unsigned char DEAD1       : 1;
  unsigned char DEAD2       : 1;
  unsigned char SOFC        : 1;
  unsigned char SOF         : 1;
  unsigned char SOFIE       : 1;
  unsigned char LCDEN       : 1;
} __BITS_LCD_CR3;
#endif
__IO_REG8_BIT(LCD_CR3,     0x5402, __READ_WRITE, __BITS_LCD_CR3);

/* LCD frequency selection register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DIV0        : 1;
  unsigned char DIV1        : 1;
  unsigned char DIV2        : 1;
  unsigned char DIV3        : 1;
  unsigned char PS0         : 1;
  unsigned char PS1         : 1;
  unsigned char PS2         : 1;
  unsigned char PS3         : 1;
} __BITS_LCD_FRQ;
#endif
__IO_REG8_BIT(LCD_FRQ,     0x5403, __READ_WRITE, __BITS_LCD_FRQ);

/* LCD Port mask register 0 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG00       : 1;
  unsigned char SEG01       : 1;
  unsigned char SEG02       : 1;
  unsigned char SEG03       : 1;
  unsigned char SEG04       : 1;
  unsigned char SEG05       : 1;
  unsigned char SEG06       : 1;
  unsigned char SEG07       : 1;
} __BITS_LCD_PM0;
#endif
__IO_REG8_BIT(LCD_PM0,     0x5404, __READ_WRITE, __BITS_LCD_PM0);

/* LCD Port mask register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG08       : 1;
  unsigned char SEG09       : 1;
  unsigned char SEG10       : 1;
  unsigned char SEG11       : 1;
  unsigned char SEG12       : 1;
  unsigned char SEG13       : 1;
  unsigned char SEG14       : 1;
  unsigned char SEG15       : 1;
} __BITS_LCD_PM1;
#endif
__IO_REG8_BIT(LCD_PM1,     0x5405, __READ_WRITE, __BITS_LCD_PM1);

/* LCD Port mask register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG16       : 1;
  unsigned char SEG17       : 1;
  unsigned char SEG18       : 1;
  unsigned char SEG19       : 1;
  unsigned char SEG20       : 1;
  unsigned char SEG21       : 1;
  unsigned char SEG22       : 1;
  unsigned char SEG23       : 1;
} __BITS_LCD_PM2;
#endif
__IO_REG8_BIT(LCD_PM2,     0x5406, __READ_WRITE, __BITS_LCD_PM2);

/* LCD Port mask register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG24       : 1;
  unsigned char SEG25       : 1;
  unsigned char SEG26       : 1;
  unsigned char SEG27       : 1;
  unsigned char SEG28       : 1;
  unsigned char SEG29       : 1;
  unsigned char SEG30       : 1;
  unsigned char SEG31       : 1;
} __BITS_LCD_PM3;
#endif
__IO_REG8_BIT(LCD_PM3,     0x5407, __READ_WRITE, __BITS_LCD_PM3);

/* LCD Port mask register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG32       : 1;
  unsigned char SEG33       : 1;
  unsigned char SEG34       : 1;
  unsigned char SEG35       : 1;
  unsigned char SEG36       : 1;
  unsigned char SEG37       : 1;
  unsigned char SEG38       : 1;
  unsigned char SEG39       : 1;
} __BITS_LCD_PM4;
#endif
__IO_REG8_BIT(LCD_PM4,     0x5408, __READ_WRITE, __BITS_LCD_PM4);

/* LCD Port mask register 5 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG40       : 1;
  unsigned char SEG41       : 1;
  unsigned char SEG42       : 1;
  unsigned char SEG43       : 1;
} __BITS_LCD_PM5;
#endif
__IO_REG8_BIT(LCD_PM5,     0x5409, __READ_WRITE, __BITS_LCD_PM5);

/* LCD display memory 0 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S000        : 1;
  unsigned char S001        : 1;
  unsigned char S002        : 1;
  unsigned char S003        : 1;
  unsigned char S004        : 1;
  unsigned char S005        : 1;
  unsigned char S006        : 1;
  unsigned char S007        : 1;
} __BITS_LCD_RAM0;
#endif
__IO_REG8_BIT(LCD_RAM0,    0x540C, __READ_WRITE, __BITS_LCD_RAM0);

/* LCD display memory 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S008        : 1;
  unsigned char S009        : 1;
  unsigned char S010        : 1;
  unsigned char S011        : 1;
  unsigned char S012        : 1;
  unsigned char S013        : 1;
  unsigned char S014        : 1;
  unsigned char S015        : 1;
} __BITS_LCD_RAM1;
#endif
__IO_REG8_BIT(LCD_RAM1,    0x540D, __READ_WRITE, __BITS_LCD_RAM1);

