yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3le89.h
/* LCD display memory 11 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S128        : 1;
  unsigned char S129        : 1;
  unsigned char S130        : 1;
  unsigned char S131        : 1;
  unsigned char S132        : 1;
  unsigned char S133        : 1;
  unsigned char S134        : 1;
  unsigned char S135        : 1;
} __BITS_LCD_RAM16;
#endif
__IO_REG8_BIT(LCD_RAM16,   0x541C, __READ_WRITE, __BITS_LCD_RAM16);

/* LCD display memory 12 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S136        : 1;
  unsigned char S137        : 1;
  unsigned char S138        : 1;
  unsigned char S139        : 1;
  unsigned char S140        : 1;
  unsigned char S141        : 1;
  unsigned char S142        : 1;
  unsigned char S143        : 1;
} __BITS_LCD_RAM17;
#endif
__IO_REG8_BIT(LCD_RAM17,   0x541D, __READ_WRITE, __BITS_LCD_RAM17);

/* LCD display memory 13 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S228        : 1;
  unsigned char S229        : 1;
  unsigned char S230        : 1;
  unsigned char S231        : 1;
  unsigned char S232        : 1;
  unsigned char S233        : 1;
  unsigned char S234        : 1;
  unsigned char S235        : 1;
} __BITS_LCD_RAM18;
#endif
__IO_REG8_BIT(LCD_RAM18,   0x541E, __READ_WRITE, __BITS_LCD_RAM18);

/* LCD display memory 12 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S236        : 1;
  unsigned char S237        : 1;
  unsigned char S238        : 1;
  unsigned char S239        : 1;
  unsigned char S240        : 1;
  unsigned char S241        : 1;
  unsigned char S242        : 1;
  unsigned char S243        : 1;
} __BITS_LCD_RAM19;
#endif
__IO_REG8_BIT(LCD_RAM19,   0x541F, __READ_WRITE, __BITS_LCD_RAM19);

/* LCD display memory 13 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S328        : 1;
  unsigned char S329        : 1;
  unsigned char S330        : 1;
  unsigned char S331        : 1;
  unsigned char S332        : 1;
  unsigned char S333        : 1;
  unsigned char S334        : 1;
  unsigned char S335        : 1;
} __BITS_LCD_RAM20;
#endif
__IO_REG8_BIT(LCD_RAM20,   0x5420, __READ_WRITE, __BITS_LCD_RAM20);

/* LCD display memory 13 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S336        : 1;
  unsigned char S337        : 1;
  unsigned char S338        : 1;
  unsigned char S339        : 1;
  unsigned char S340        : 1;
  unsigned char S341        : 1;
  unsigned char S342        : 1;
  unsigned char S343        : 1;
} __BITS_LCD_RAM21;
#endif
__IO_REG8_BIT(LCD_RAM21,   0x5421, __READ_WRITE, __BITS_LCD_RAM21);


/*-------------------------------------------------------------------------
 *      LCD bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define LCD_CR1_B2               LCD_CR1_bit.B2
#define LCD_CR1_DUTY0            LCD_CR1_bit.DUTY0
#define LCD_CR1_DUTY1            LCD_CR1_bit.DUTY1
#define LCD_CR1_BLINKF0          LCD_CR1_bit.BLINKF0
#define LCD_CR1_BLINKF1          LCD_CR1_bit.BLINKF1
#define LCD_CR1_BLINKF2          LCD_CR1_bit.BLINKF2
#define LCD_CR1_BLINK0           LCD_CR1_bit.BLINK0
#define LCD_CR1_BLINK1           LCD_CR1_bit.BLINK1

#define LCD_CR2_VSEL             LCD_CR2_bit.VSEL
#define LCD_CR2_CC0              LCD_CR2_bit.CC0
#define LCD_CR2_CC1              LCD_CR2_bit.CC1
#define LCD_CR2_CC2              LCD_CR2_bit.CC2
#define LCD_CR2_HD               LCD_CR2_bit.HD
#define LCD_CR2_PON0             LCD_CR2_bit.PON0
#define LCD_CR2_PON1             LCD_CR2_bit.PON1
#define LCD_CR2_PON2             LCD_CR2_bit.PON2

#define LCD_CR3_DEAD0            LCD_CR3_bit.DEAD0
#define LCD_CR3_DEAD1            LCD_CR3_bit.DEAD1
#define LCD_CR3_DEAD2            LCD_CR3_bit.DEAD2
#define LCD_CR3_SOFC             LCD_CR3_bit.SOFC
#define LCD_CR3_SOF              LCD_CR3_bit.SOF
#define LCD_CR3_SOFIE            LCD_CR3_bit.SOFIE
#define LCD_CR3_LCDEN            LCD_CR3_bit.LCDEN

#define LCD_FRQ_DIV0             LCD_FRQ_bit.DIV0
#define LCD_FRQ_DIV1             LCD_FRQ_bit.DIV1
#define LCD_FRQ_DIV2             LCD_FRQ_bit.DIV2
#define LCD_FRQ_DIV3             LCD_FRQ_bit.DIV3
#define LCD_FRQ_PS0              LCD_FRQ_bit.PS0
#define LCD_FRQ_PS1              LCD_FRQ_bit.PS1
#define LCD_FRQ_PS2              LCD_FRQ_bit.PS2
#define LCD_FRQ_PS3              LCD_FRQ_bit.PS3

#define LCD_PM0_SEG00            LCD_PM0_bit.SEG00
#define LCD_PM0_SEG01            LCD_PM0_bit.SEG01
#define LCD_PM0_SEG02            LCD_PM0_bit.SEG02
#define LCD_PM0_SEG03            LCD_PM0_bit.SEG03
#define LCD_PM0_SEG04            LCD_PM0_bit.SEG04
#define LCD_PM0_SEG05            LCD_PM0_bit.SEG05
#define LCD_PM0_SEG06            LCD_PM0_bit.SEG06
#define LCD_PM0_SEG07            LCD_PM0_bit.SEG07

#define LCD_PM1_SEG08            LCD_PM1_bit.SEG08
#define LCD_PM1_SEG09            LCD_PM1_bit.SEG09
#define LCD_PM1_SEG10            LCD_PM1_bit.SEG10
#define LCD_PM1_SEG11            LCD_PM1_bit.SEG11
#define LCD_PM1_SEG12            LCD_PM1_bit.SEG12
#define LCD_PM1_SEG13            LCD_PM1_bit.SEG13
#define LCD_PM1_SEG14            LCD_PM1_bit.SEG14
#define LCD_PM1_SEG15            LCD_PM1_bit.SEG15

#define LCD_PM2_SEG16            LCD_PM2_bit.SEG16
#define LCD_PM2_SEG17            LCD_PM2_bit.SEG17
#define LCD_PM2_SEG18            LCD_PM2_bit.SEG18
#define LCD_PM2_SEG19            LCD_PM2_bit.SEG19
#define LCD_PM2_SEG20            LCD_PM2_bit.SEG20
#define LCD_PM2_SEG21            LCD_PM2_bit.SEG21
#define LCD_PM2_SEG22            LCD_PM2_bit.SEG22
#define LCD_PM2_SEG23            LCD_PM2_bit.SEG23

#define LCD_PM3_SEG24            LCD_PM3_bit.SEG24
#define LCD_PM3_SEG25            LCD_PM3_bit.SEG25
#define LCD_PM3_SEG26            LCD_PM3_bit.SEG26
#define LCD_PM3_SEG27            LCD_PM3_bit.SEG27
#define LCD_PM3_SEG28            LCD_PM3_bit.SEG28
#define LCD_PM3_SEG29            LCD_PM3_bit.SEG29
#define LCD_PM3_SEG30            LCD_PM3_bit.SEG30
#define LCD_PM3_SEG31            LCD_PM3_bit.SEG31

#define LCD_PM4_SEG32            LCD_PM4_bit.SEG32
#define LCD_PM4_SEG33            LCD_PM4_bit.SEG33
#define LCD_PM4_SEG34            LCD_PM4_bit.SEG34
#define LCD_PM4_SEG35            LCD_PM4_bit.SEG35
#define LCD_PM4_SEG36            LCD_PM4_bit.SEG36
#define LCD_PM4_SEG37            LCD_PM4_bit.SEG37
#define LCD_PM4_SEG38            LCD_PM4_bit.SEG38
#define LCD_PM4_SEG39            LCD_PM4_bit.SEG39

